# -*- coding: utf-8 -*-

import simple_draw as sd
from snowfall import create_snowflakes, paint_snowflakes_with_color, move_snowflakes, numbers_reached_down_screen, \
    delete_snowflakes

sd.resolution = (1000, 500)

# На основе кода из lesson_004/05_snowfall.py
# сделать модуль snowfall.py в котором реализовать следующие функции
#  создать_снежинки(N) - создает N снежинок
#  нарисовать_снежинки_цветом(color) - отрисовывает все снежинки цветом color
#  сдвинуть_снежинки() - сдвигает снежинки на один шаг
#  номера_достигших_низа_экрана() - выдает список номеров снежинок, которые вышли за границу экрана
#  удалить_снежинки(номера) - удаляет снежинки с номерами из списка
# снежинки хранить в глобальных переменных модуля snowfall
#
# В текущем модуле реализовать главный цикл падения снежинок,
# обращаясь ТОЛЬКО к функциям модуля snowfall

N = 20
create_snowflakes(N)
# создать_снежинки(N)
while True:
    paint_snowflakes_with_color(sd.background_color)
    move_snowflakes()
    paint_snowflakes_with_color(sd.COLOR_WHITE)
    if numbers_reached_down_screen():
        delete_snowflakes()
        create_snowflakes(N)
    #  нарисовать_снежинки_цветом(color=sd.background_color)
    #  сдвинуть_снежинки()
    #  нарисовать_снежинки_цветом(color)
    #  если есть номера_достигших_низа_экрана() то
    #       удалить_снежинки(номера)
    #       создать_снежинки(count)
    sd.sleep(0.1)
    if sd.user_want_exit():
        break

sd.pause()

# зачёт! 🚀
